label TS_day_1_su:
    $ day_time()
    $ persistent.sprite_time = "day"
    $ new_chapter(3, u"Лагерь. День первый")
    "..."
    play music music_list["no_tresspassing"] fadein 1
    scene bg ext_polyana_day with dissolve
    "Первое, что я увидел - свет."
    show uv nake_smile with dissolve
    "Второе что я увидел - голые сиськи."
    th "Хотя может и их первыми."
    th "Не то, чтобы я озабоченный, но когда ты просыпаешься в незнакомом месте и рядом сидит незнакомая голая девушка, то вполне естественно обратить внимание на её обнажённую грудь."
    th "В первую очередь она голая."
    th "А потом уже незнакомая и всё остальное."
    gg "Ты кто?"
    uv "Здрасте…{w} Мне повторно представляться надо?"
    "Голос оказался знакомым."
    gg "Ю… ю…ю"
    uv "Йес-йес. Итс ми. Родной язык забыл?"
    gg "Но ты же кошка!{w} В смысле, была кошкой! {w}Что, чёрт возьми, случилось? Где мы? Кто ты такая?"
    uv "Так. Давай по порядку. Я Юля. В том мире была кошкой. В этой человек. В третьем… буду ещё кем-то. Не заморачивайся."
    show uv nake_angry with dspr
    uv "А то укушу!"
    gg "Не надо."
    show uv nake_smile with dspr
    uv "Мы недалеко от пионерского лагеря."
    gg "Их же давно уже нет!"
    uv "А ещё мы в прошлом. Не бойся, всего лишь 30 лет назад. И не надолго. Ты же сам хотел изменить свою жизнь, так?"
    gg "Так."
    uv "Вот у тебя появилась возможность.{w} Можешь не благодарить."
    gg "Я и не собирался."
    show uv nake_angry3 with dspr
    uv "И прекрати пялиться на мою грудь. {w} Это, знаешь ли, раздражает."
    gg "Прости."
    "Я поднял взгляд повыше."
    gg "У тебя уши!"
    uv "У тебя тоже."
    gg "Да нет. У тебя кошачьи уши!"
    show uv nake_sur with dspr
    uv "Правда?"
    "Девушка потрогала свои ушки."
    uv "Странно. Должны были человеческими стать.  {w} Ой! И хвост остался. {w}Ну дела… {w}Ладно. Что-нибудь придумаем.{w} Пошли!"
    gg "Куда?"
    uv "В лагерь. Сейчас утро. Надо на завтрак успеть."
    gg "Как ты можешь сейчас думать про еду?"
    show uv nake_smile with dspr
    uv "А почему нет? Ты разве не можешь?"
    gg "Нет! Я напился до чёртиков, разговаривал с котом. {w}Попал в какой-то лес.{w} Очутился в прошлом.{w}"
    gg "Передо мной получеловек-полукот.{w} Без обид, но мне сейчас не до еды. {w} И чуть не забыл:"
    gg "ТЫ - ГОЛАЯ!"
    uv "Ну голая, ну и что? Ты что никогда голых девушек не видел?"
    gg "Живых нет. В смысле, живьём. В смысле, в живую."
    show uv nake_angry3 with dspr
    uv "Всё! {w} Снимай рубашку!"
    gg "Не понял.. мы что, сейчас…"
    uv "Нет! Просто пока я голая, ты не способен нормально думать."
    "Я послушно расстался с рубашкой."
    uv "Штаны тоже."
    gg "Но как же…"
    uv "Снимай, снимай. На мою попку ты тоже будешь отвлекаться."
    gg "Да я не про это! Как ты будешь их носить? У тебя же хвост."
    uv "А у тебя член! Ну и что? Не мешает же штаны носить."
    gg "Я его в одну из штанин…"
    show uv nake_laugh with dspr
    stop music fadeout 1
    uv "Вот и я так же сделаю."
    play music music_list["reflection_on_water"] fadein 1
    "Градус сумасшествия происходящего так повысился, что мозг просто перестал подавать сигналы бедствия."
    show uv rubash_smile with dspr
    "Мы переоделись."
    "Стало немного лучше."
    "По крайней мере исчезла неловкость."
    "Правда теперь я был полуголым."
    "Слава Богу, хотя бы в трусах. Пусть и дырявых."
    "Юля взяла меня за руку и повела по лесу."
    show uv rubash_smile with dspr
    show bg ext_path_day with dissolve
    $ renpy.pause(0.25)
    show uv rubash_smile with dspr
    show bg ext_path2_day with dissolve
    $ renpy.pause(0.25)
    show uv rubash_smile with dspr
    show bg ext_camp_entrance_day with dissolve
    uv "Вот тут будет решаться твоя судьба."
    gg "А как именно? В смысле, что я должен делать?"
    show uv rubash_angry with dspr
    uv "Для начала, попробуй думать самостоятельно."
    gg "Извини, но я не часто попадаю в прошлое.{w} И совершенно не знаю, как себя вести."
    show uv rubash_laugh with dspr
    uv "А в настоящем ты прям грамотно себя вёл?"
    gg "Нет, но… {w} действовал по обстоятельствам."
    show uv rubash_angry with dspr
    uv "Вот и действуй по обстоятельствам."
    gg "Хм-м-м… ну мы возле детского лагеря. {w} Возможно, мы можем прикинуться опоздавшими."
    show uv rubash_smile with dspr
    uv "Уже неплохо. Начинаешь использовать голову по назначению."
    gg "Надо сказать, что документы им выслали, пусть сами ищут."
    uv "Так их! Пусть чувствуют себя виноватыми."
    gg "Самое сложное - это объяснить наш внешний вид. {w} И твои уши."
    uv "Справедливо."
    gg "Значит что?"
    uv "Что?"
    gg "Первым делом надо надыбать одежду."
    scene bg ext_clubs_day 
    show uv rubash_smile
    with dissolve

    gg "Куда теперь идти?"
    uv "Ты решай."
    gg "Я тут впервой. {w}В какой стороне прачечная или склад?"
    uv "Без понятия. {w}Но знаю, что душевая вон там."
    gg "Откуда? {w}В смысле, почему ты знаешь, где душевая?"
    uv "Я слышу плеск воды."
    gg "А почему я ничего не слышу?"
    show uv rubash_laugh with dspr
    uv "Алё!"
    "Юля показала на свои ушки."
    gg "Допустим. И как нам поможет душевая?"
    uv "Где душ - там много бесхозной одежды"
    scene exxt_shower_day 
    show uv rubash_laugh
    with dissolve

    gg "Куда теперь? Тут даже не указано, где ''Эм'' где ''Жо''"
    uv "Ну так проверь! Я на стрёме постою."
    gg "А почему я?"
    uv "Потому что парня без штанов в душевой объяснить легче, чем девушку с хвостом."
    gg "Логично."
    window hide
    stop music fadeout 1
    scene int_shower_day_dev with dissolve
    th "Это - не мужские шмотки. А значит там..."
    play music music_list["gentle_predator"] fadein 2

    menu:
        "Подсмотреть":
            $ depr -= 1
            jump TS_podsmotr_su
        "Уйти":
            jump TS_uyyti

label TS_podsmotr_su:
    scene cg slavya_dush with dissolve
    window show
    th "Не зря заглянул."
    th "Не смотря ни на что, день начинается не так уж плохо."
    th "Я даже поесть не успел, а уже полюбовался на двух обнажённых красоток."
    scene exxt_shower_day
    show uv rubash_angry
    with dissolve
    uv "Ты чего так долго?"
    gg "Не важно. Нам в следующую."
    uv "Ну так иди. Чего ждёшь?"
    jump TS_day_1_1_su

label TS_uyyti:
    scene exxt_shower_day
    show uv rubash_smile
    with dissolve
    window show
    uv "Не та?"
    gg "Не та. Нам в следующую."
    uv "Ну так иди. "

label TS_day_1_1_su:
    scene int_shower_day_mal_cloth with dissolve
    th "Шорты. Рубашка."
    th "Что ж... Прости таинственный незнакомец."
    window hide
    scene int_shower_day_mal with dissolve
    $ renpy.pause(0.25)
    scene exxt_shower_day
    show uv rubash_smile
    with dissolve    

    window show   
    gg "Готово."
    uv "Почти. {w}Мне всё ещё нужна шапочка. {w}"
    gg "И где мне её взять?"
    uv "Придумай что-нибудь."
    gg "Давай для начала свалим отсюда. {w}Пока хозяин штанов не объявился."
    stop music fadeout 1
    "Мы поспешили прочь."
    play music music_list["my_daily_life"] fadein 2
    scene bg ext_musclub_day
    show uv rubash_smile
    with dissolve    

    "Возле деревянного домика я остановился."
    gg "Стой!"
    uv "Что такое?"
    gg "Смотри."
    "Я показал на висящую на здании стенгазету."
    uv "\"Достижения юных талантов\". И два каких-то парня. И что?"
    gg "Да пофиг мне на то, что на ней. {w}Главное, что из этой газеты можно сделать кое-что полезное."
    "Я начал складывать газету, а Юля - внимательно наблюдала за моими действиями."
    "Когда я закончил, то в руках у меня была самодельная пилотка."
    gg "Держи. На первое время хватит, а потом что-нибудь придумаем."
    show uv gaset_smile with dspr
    uv "Спасибо большое."
    gg "Теперь что?"
    uv "Я уже говорила. Ты должен действовать самостоятельно."
    gg "Угу. Ты лишь указываешь на дверь, а войти должен я."
    show uv gaset_sur with dspr
    uv "Какая ещё дверь? Причём тут это?"
    gg "Не обращай внимание. Это из одного фильма…{w} Короче нам надо заселиться, так? А для этого надо что?"
    uv "Что?"
    gg "Найти местный ресепшн. Или как оно по-советски будет? Администрация?"
    show uv gaset_normal with dspr
    uv "И как будешь искать?"
    gg "Я надеялся, что ты подскажешь. Как с душем."
    uv "Это каким же образом?"
    gg "Не знаю. Услышишь шелест бумаг."
    show uv gaset_smile with dspr
    uv "Так…. давай по-другому. {w}Представь, что меня тут нет. И тебе самому надо выпутываться.{w} Что ты делаешь, когда не знаешь дорогу?"
    gg "Ну спрашиваю у кого-нибудь."
    uv "Что сейчас мешает? Рот у тебя есть. Уши есть. Разговаривать умеешь…"
    gg "Да хорошо что всего на 30 лет назад вернулся. А не на 300."
    th "Интересно, как бы я тогда спрашивал дорогу?"
    stop music fadeout 1
    "\"Бью челом, путник! Соблаговолите поведать кратчайший путь до воеводы.\""
    window hide
    $ renpy.pause(0.25)
    scene bg ext_path_day with dissolve
    $ renpy.pause(0.25)
    scene bg ext_square_day
    show uv gaset_laugh2 at left
    with dissolve
    window show

    play music music_list["went_fishing_caught_a_girl"] fadein 2
    uv "Вон! Смотри, местная обитательница."
    window hide
    scene cg butterfly100 with dissolve
    $ renpy.pause(2.5)

    scene bg ext_square_day
    show un smile pioneer far at right
    show uv gaset_laugh2 at left
    with dissolve
    uv "И задница - что надо. Так и хочется шлёпнуть!"
    gg "Тихо! Мы тут гости и надо вести себя прилично. Я даже у себя на районе такие вольности себе не позволял."
    show uv gaset_angry with dspr
    uv "Ну конечно. Это котов можно без спроса тискать и гладить. А к человекам почёт и уважение."
    show uv gaset_normal
    show un smile pioneer at right
    with dissolve
    "Юля решительно направилась к девушке и, подойдя поближе размахнулась…"
    "Я схватил Юлю за руку, но инерция была так сильна что шлепок всё равно состоялся."
    #"(эмбиент - шлепок)"
    "Причём моей рукой."
    show un scared pioneer with dspr
    un "Ой!"
    th "Чёрт!"
    show uv gaset_laugh with dspr
    uv "Привет! Прости, что побеспокоили. Мы - Мухины. Только приехали. Я Юля"
    un "Й-й-йа Лена…"
    uv "Очень приятно! {w}Уверена мы с тобой станем лучшими подругами!"
    th "Девушка выглядела знакомо…{w} очень знакомо…{w} Так ведь это же"
    th "Мама?"
    th "Охренеть, не встать!"
    show un shy pioneer with dspr
    un "Э-э-э… конечно."
    uv "А что ты там разглядывала?"
    un "Бабочку."
    show uv gaset_sur2 with dspr
    uv "Ух ты! Какая красивая. {w}Я тоже люблю бабочек. {w}Давай вместе половим."
    gg "Ма… ма… ма…"
    un "Что?"
    show uv gaset_laugh2 with dspr
    uv "Он хочет сказать, что его зовут Максим. {w}Можно просто Макс. {w}Даже лучше. Сама видишь. Заика…."
    show un smile2 pioneer with dspr
    un "Ой! Ну это ничего. Ты главное не переживай.{w} Я вот в детстве картавила."
    show uv gaset_laugh with dspr
    uv "А я шепелявила. {w}Как у нас много общего! {w}Правда здорово, Максик?"
    un "Но я потом научилась говорить правильно."
    uv "И Максик научится. {w}Когда-нибудь. {w}Мы ему будем помогать всеми силами."
    gg "Да нормально я разговариваю!"
    show un surprise pioneer with dspr
    show uv gaset_sur2 with dspr
    uv "Свершилсь чудо! {w}Максимка заговорил. Ура!{w} Мы вылечили братика…"
    "Юля взяла всё ещё растерянную Лену за руки и стала прыгать."
    show uv gaset_laugh2 with dspr
    uv "А теперь скажи быстро: ''Наши поезда - самые поездатые поезда в мире…'' {w}Хотя нет. Это слишком сложная. {w}Давай вот эту: ''Из преподвыперта зайчик преподвыпернулся''"
    gg "Из преподвыперта самый поездатый зайчик… тьфу ты. {w}Задурила голову! {w}Ма… Лена, мы просто хотели спросить, где тут начальство? Чтоб оформить…  ся."
    show un smile pioneer with dspr
    un "А-а-а…{w} ну администрация там. Только она закрыта. {w}Вам лучше к Ольге Дмитриевне. Она старшая вожатая.{w} Это третий домик, если идти по той дороге. Вы его сразу узнаете, рядом куст сирени растёт."
    show uv gaset_smile with dspr
    uv "Спасибо тебе огромное. {w}Ты наша спасительница."
    show un smile pioneer with dspr
    un "Пожалуйста. {w}Приятно было познакомиться{w}. Юля.{w} И Макс… им."
    show uv gaset_laugh with dspr
    uv "И нам, и нам. {w}Мы ещё обязательно увидимся. {w}До встречи…{w} Максик, попрощайся!"
    gg "Что? {w}Ах, да.{w} Пока..."

    scene bg ext_houses_day with dissolve
    play music music_list["my_daily_life"] fadein 2
    show uv gaset_laugh at left with dissolve
    gg "Какого чёрта ты не сказала, что тут моя мама?!"
    show uv gaset_laugh2 with dspr
    uv "Чтобы не испортить сюрприз. {w}И потом, ты же сам захотел изменить свою жизнь."
    gg "Через встречу с молодой версией матери? {w}Это как-то не нормально…"
    show uv gaset_smile with dspr
    uv "А что ты думал тут будет? {w}Побываешь в прошлом, пообщаешься с местными пару дней - и твоя жизнь круто поменяется? Только потому что ты что-то там поймёшь?{w} Фигушки! {w}Так только в дешёвых сериалах работает."
    gg "А как же Сэм?"
    show uv gaset_sur with dspr
    uv "Кто?"
    gg "Ну Сэм. Из Властелина Колец. {w}Он же отправился с Фродо в приключение. Там чё-то понял, научился. И смог пригласить Розочку на свидание."
    show uv gaset_laugh2 with dspr
    uv "Так то Властелин Колец. Там он два года проходил через страдания и лишения.{w} А ты - в пионерлагерь попал на денёк. Где самое страшное - это манная каша с комками.{w} Это во-первых.{w} А во-вторых, кончай занудствовать. Расскажешь своей крале про властелин колец, и тебе уже никакие путешествия во времени не помогут."
    gg "Так что ж мне делать?{w} Попросить свою мать лучше воспитывать будущего… {w}Погоди, а если я тут что-то изменю, я же не исчезну?"
    show uv gaset_smile with dspr
    uv "Будем надеется, что нет. {w}Но на всякий случай, действуй осторожно. {w}Никаких глобальных изменений. Ставок на спорт, не рассказывай ей сюжет Гарри Поттера{w} и самое главное ни в коем случае не трахайся с ней!"
    gg "ЧЕГО?"
    show uv gaset_laugh with dspr
    uv "Что? Твоя мама красотка. А ты - извращенец. Вполне вероятное развитие событий.{w} Ты здесь и двух часов не пробыл, а уже полапал её за задницу. {w}Понятное дело, она как персик. Так и просится в руку."
    gg "Это вышло случайно!"
    show uv gaset_laugh2 with dspr
    uv "А на сиськи её тоже случайно смотрел?"
    gg "Ничего я не смотрел."
    uv "Конечно, у неё буфера побольше моих. Зато у меня уши больше."
    gg "Так, всё! {w}Закрыли тему. Мы оба будем крайне осторожны."
    show uv gaset_smile with dspr
    uv "Как скажешь, капитан!{w} Что прикажете делать дальше?"
    gg "Поищем эту Дмитрию Ольговну."
    show uv gaset_laugh2 with dspr
    uv "Есть.{w} На жопе шерсть. {w}Кстати, у меня действительно немного есть. Потом покажу…"
    gg "Не надо. Я верю."
    uv "Уверен? {w}Не каждому выпадает возможность поглазеть на шерстистую задницу фурри…"
    gg "Давай сосредоточимся на текущих проблемах. Ищем куст сирени."
    scene bg ext_house_of_mt_day
    show uv gaset_laugh2 at left
    with dissolve
    uv "Вот куст. А значит это её домик."
    gg "Говорить буду я."
    show uv gaset_sur with dspr
    uv "Почему ты?"
    gg "Потому что я не хочу, чтобы ты комментировала размер её сисек и форму её задницы."
    show uv gaset_angry with dspr
    uv "Пф-ф-ф.. тоже мне неженка."
    gg "Мои чувства тут не причём. {w}Я не хочу, чтоб меня выгнали, ещё до заселения. {w}Тебе-то хорошо, ты на мышей охотиться будешь. А мне что делать?"
    show uv gaset_smile with dspr
    uv "Не переживай. Всё будет хорошо."
    gg "Приятно слышать."
    uv "Угу. Я поделюсь с тобой кусочком мышки."
    gg "Что?"
    show uv gaset_laugh2 with dspr
    uv "Надеюсь, тебе нравятся хвосты. Иначе останешься голодным."
    show mt normal panama pioneer with dspr
    play music music_list["get_to_know_me_better"] fadein 1
    mt "Ой! А вы кто такие?"
    show uv gaset_laugh with dspr
    uv "Здравствуйте, Ольга Дмитриевна! Мы - Мухины! Юля и Максим. Только что прибыли в ваш отряд, чтобы пополнить славные ряды пионеров! Ура!"
    "Юля отдала честь по-пионерски."
    "Я неловко повторил за ней."
    show mt surprise panama pioneer with dspr
    mt "Новенькие? А почему мне никто не доложил?"
    show uv gaset_smile with dspr
    uv "Так это всё дедушкины проделки. Он специально не разрешает сообщать, чтобы для нас специально ничего не готовили."
    mt "А дедушка у нас кто?"
    uv "Секретарь обкома!"
    mt "Точно? Не врёте?"
    show uv gaset_laugh with dspr
    gg "Да, он нас сам сюда привёз. На Волге. А как бы мы ещё сюда попали? Не пешком же!"
    show mt smile panama pioneer with dspr
    mt "Эм-м-м… {w}Добро пожаловать в Совёнок! {w}Давайте вас куда-нибудь заселим. У нас, правда, всего один свободный домик. Тебя, Юля, туда. А тебя, к кому-нибудь подселим. Будете по очереди на раскладушке спать."
    show uv gaset_smile with dspr
    uv "А можно нас в один домик?"
    mt "Если честно, обычно мы не селим мальчиков с девочками, но раз вы брат и сестра, то ладно."
    show uv gaset_laugh with dspr
    uv "УРА!!!!"
    mt "Юля, Юля… я очень рада, что в тебе столько энтузиазма, только давай радоваться чуть-чуть потише. Просто у нас тут маленькие детки, и они могут… {w}эм-м-м…{w} испугаться."
    show uv gaset_laugh2 with dspr
    uv "Обожаю деток! Жду не дождусь, когда удасться с ними поиграть."
    mt "Да-да. Это замечательно. Давайте как всё таки вас заселим."
    show uv gaset_smile with dspr
    uv "Хорошо! Где наш домик."
    mt "А давайте я вас провожу! Или нет…{w} лучше Славя вас проводит. Славя!"
    show sl normal pioneer at right with easeinright
    mt "Знакомьтесь. Это - Славя. Наша лучшая пионерка. И моя помощница. Славя, это наши новые пионеры. Максим и Юля Мухины."
    sl "Очень приятно."
    uv "И нам очень приятно!"
    mt "Покажи им свободный домик. Выдай бельё и форму. И проведи экскурсию."
    stop music fadeout 1
    sl "Будет сделано."
    hide mt smile panama pioneer
    hide sl normal pioneer at right
    show sl normal pioneer
    with dspr
    play music music_list["she_is_kind"] fadein 1
    sl "Ну что? Вам сперва экскурсию провести? Или сразу заселитесь?"
    show uv gaset_laugh with dspr
    uv "Можно и так и так. Мы на всё согласны. Правда, братик?"
    gg "Не на всё."
    uv "Бу-бу-бу."
    show sl smile pioneer with dspr
    sl "Знаете, а вы не сильно похожи. Обычно братья и сёстры такие одинаковые. Вот моих братьев если в ряд выстроить - сразу видно, что родственники."
    show uv gaset_laugh with dspr
    uv "Как матрёшки! Ха-ха-ха…"
    sl "Точно! Ты такая позитивная. {w}Аж самой хочется смеятся."
    uv "Спасибо, ты тоже. {w}Надеюсь, мы подружимся."
    sl "Конечно. А он чего всё время молчит?"
    show uv gaset_smile with dspr
    uv "Не обращай внимание. {w}Он, как красивую девушку увидит - сразу смущается и дар речи теряет."
    show sl shy pioneer with dspr
    sl "Правда что ли? Это - так мило. Ты считаешь меня красивой?"
    gg "Что?{w} Нет…{w} То есть, да.{w} Конечно, ты красивая. {w}Но я не поэтому молчу. И вообще не молчу."
    uv "Вот видишь? {w}Уже засмущался."
    show sl smile2 pioneer with dspr
    sl "Давайте тогда сначала заселимся. {w}А потом экскурсия. {w}После обеда."
    uv "А как же завтрак?"
    show sl normal pioneer with dspr
    sl "Уже закончился.{w} Но если хотите могу вам что-нибудь принести, если осталось."
    uv "Не надо. Лучше расскажи, что там?"
    hide sl normal pioneer
    scene bg ext_houses_day
    show sl normal pioneer
    show uv gaset_smile at left
    with dissolve
    sl "Вот там у нас главная площадь. Вы её, наверное уже видели, чуть дальше пляж. А в той стороне кружки."
    uv "Какие такие кружки?"
    sl "Разные. Музыкальные, рисовальные, театральные. Даже есть кружок кибернетиков. {w}Максим, тебе может понравится."
    gg "Чё это мне должно понравится?"
    sl "Не знаю. Там тоже такие молчаливые серьёзные ребята.{w} Да всем мальчишкам техника нравится! Любишь мастерить?"
    gg "Ну мы с дедом как-то самогонный аппарат чинили…"
    show uv gaset_sur with dspr
    show sl surprise pioneer with dspr
    sl "Что?"
    "Юля наступила мне на ногу. Явно специально."
    show uv gaset_smile with dspr
    uv "Максик шутит. А что там?"
    show sl normal pioneer with dspr
    sl "А там запасной выход из лагеря. Но он всегда открыт. Так что можно по грибы ходить."
    uv "Здорово. Обязательно сходим. {w}Спорим, я больше всех соберу!"
    hide sl normal pioneer
    scene ext_house_of_ggs_day
    show uv gaset_smile at left
    show sl normal pioneer
    with dissolve
    sl "Вот ваше новое жилище. Располагайтесь. А я сбегаю на склад, что-нибудь поищу для вас."
    "Славя положила нам руки на плечи и ушла."
    hide sl normal pioneer with dissolve
    play music music_list["smooth_machine"] fadein 2
    gg "Она меня коснулась!"
    show uv gaset_normal with dissolve
    uv "И что?"
    gg "Это значит, что я ей понравился?"
    uv "Не говори ерунды! Меня она тоже коснулась. {w}По-твоему, и я ей понравилась?"
    gg "Нет. То есть понравилась, как подружка. А я - как парень."
    uv "Ты хочешь сказать, что если девушка касается другую девушку, то это дружеский жест. А если другого парня, то это романтический жест?"
    gg "Ну да…"
    uv "А если она лесбиянка?"
    gg "Она - не лесбиянка!"
    uv "С чего ты взял?"
    gg "Она - не похожа на лесбиянку!"
    uv "А как, по-твоему, должны выглядеть лесбиянки?"
    gg "Маленькие, тёмненькие и в очках. {w}А она высокая светленькая и без очков."
    show uv gaset_laugh with dspr
    uv "Логика просто высшего уровня. {w}Что ты только забыл в своём ПТУ? Тебя в Оксворд надо…"
    gg "Откуда ты вообще знаешь про Оксфорд? Ты же… ты же…"
    show uv gaset_angry2 with dspr
    uv "Кто?"
    gg "Ну… кот! Кошка."
    uv "И что?"
    gg "Не знаю. Обычно в университет не принимают котов. Или для волшебных сделали исключение? {w}Так тебе тогда не в Оксфорд надо, а в Хогвардс…"
    show uv gaset_normal with dspr
    uv "Юморист из тебя такой же, как из меня балерина."
    play sound dver
    # scene int_extra_house_dayy with dissolve
    show int_extra_house_dayy at truecenter with dissolve
    show uv gaset_normal at left zorder 1 with dissolve
    uv "Пожалуй, я буду сверху."
    gg "Ты же… о кроватях, да?"
    show uv gaset_angry3 with dspr
    uv "Конечно о кроватях, извращенец!"
    gg "Да ладно, чё ты? Я просто спросил."
    show uv gaset_normal with dspr
    uv "Спросил он, ага.{w} Кажется я поняла, в чём твоя проблема? Ты везде видишь пошлый подтекст."
    gg "Кто сказал, что это проблема?"
    uv "Я сказала! Этого мало?"
    gg "Ну-у-у…"
    uv "Вот и хорошо. А теперь пошли."
    gg "Куда?"
    show uv gaset_smile with dspr
    uv "Наружу. Не сидеть же в трёх стенах."
    gg "А вдруг Славя вернётся…"
    uv "Не переживай. Дверь всё равно не запирается."
    "Я промолчал, потому что весомых аргументов остаться в домике, у меня не было."
    th "А причина ещё пообщаться со Славей показалась мне жалкой…"
    th "Озвучь я её и Юлька станет надо мной потешаться. И правильно сделает."
    window hide
    show int_extra_house_dayy at truecenter
    show uv gaset_normal at left
    with dissolve
    pause(0.25)
    show ext_square_day at truecenter
    show uv gaset_normal at left
    with dissolve
    window show
    uv "Куда теперь?"
    "Я прочитал надпись на табличке:"
    gg "Кружки. Пирс. Противная площадка."
    show uv gaset_sur with dspr
    uv "Спортивная?"
    gg "Нет. Именно противная. Кто-то прикололся. И исправил."
    show uv gaset_laugh2 with dspr
    uv "Кто-то с таким же чувством юмора, как уебя."
    gg "Когда найду его обязательно с ним подружусь."
    show uv gaset_smile with dspr
    uv "Куда пойдём?"
    gg "Давай на пирс."
    show uv gaset_sur at left with dissolve
    uv "Почему туда?"
    gg "Там ничего не делать не надо."
    show uv gaset_angry with dspr
    uv "Ты - ленивая жопа."
    gg "Я за тебя переживаю. В спортивном костюме все сразу увидят твой хвост."
    uv "А кружки? Чем театральный плох? Хвостик и ушки я объясню таким вот реквизитом."
    gg "Это сработает, только если они репку ставят, или кота в сапогах. Или любой другой спектакль, где есть котики."
    gg "А если какую-нибудь Ромео и Джульетту? Как ты объяснишь появление хвостатого в старой Вероне?"
    show uv gaset_smile with dspr
    uv "Авторская постановка. Вместо враждующих человеческих семейств там будут кошки и собаки."
    gg "Ага. Мяутекки и Гавкулетти."
    show uv gaset_laugh with dspr
    uv "Уже лучше. Я про твои шутки."

    scene bg ext_boathouse_day with dissolve
    show un normal pioneer far at center with dissolve

    play music music_list["what_do_you_think_of_me"] fadein 2
    show uv gaset_smile at left with dspr

    uv "Смотри! А вон твоя мамка сидит. Пошли к ней!"
    gg "Зачем?"
    uv "Поболтаем."

    show un surprise pioneer with dspr

    uv "Привет, Лена! Как дела?"
    un "П-п-привет. Ещё раз."
    uv "А мы уже заселились. В последний незанятый домик. Представляешь, как здорово?"

    show un smile2 pioneer with dspr

    un "Да."
    uv "Приходи к нам в гости."

    show un surprise pioneer with dspr

    un "К вам? Зачем?"
    show uv gaset_laugh with dspr
    uv "На новоселье! Ха-ха-ха…"

    show un smile pioneer with dspr

    un "Конечно. Я с радостью. Только мне нечего принести с собой. А с пустыми руками… как-то неудобно."
    uv "А нам угостить нечем! Не беда! Что-нибудь придумаем. Правда, Максик?"
    "Меня снова втягивают в беседу, смысла которой я не понимаю."
    gg "Что? Я не уверен. Можно в магаз, сгонять."

    show un surprise pioneer with dspr

    un "Что?"
    show uv gaset_angry with dspr
    "Юля пихнула меня под рёбра."

    show uv gaset_smile with dspr

    gg "Можно, попросить в столовой…"
    uv "Так и поступим! А ты что тут делаешь?"

    show un shy pioneer with dspr

    un "Я? Да ничего. Просто… гуляю."
    uv "Просто так? Без цели? Это же скучно! Давайте гулять вместе. И не просто гулять, а что-нибудь делать. Хотя бы цветы собирать!"

    "Юля нагнулась и сорвала ромашку."
    show uv gaset_laugh with dspr

    uv "Кто больше всех соберёт, тот победил."

    "Мама постояла несколько секунд в нерешительности, а потом присоединилась к Юле."
    "Потом и я подтянулся к этому не самому мужественному занятию. Просто чтобы не стоять без дела."

    scene cg un_uv_flowers with dissolve

    "Взгляд против воли то и дело останавливался на девушках, которые нагибались за цветами. То есть позы были весьма пикантными."
    "И мне приходилось напоминать самому себе, что одна из этих девушек - моя мать. А вторая даже не человек."

    scene bg ext_boathouse_day
    show un normal pioneer at center
    show uv gaset_smile at left
    with dissolve

    "Когда цветов стало много, Юля как будто забыла про соревнование и предложила сплести венок."
    "Они на пару быстро сделали из кучи ромашек и одуванчиков единое целое."

    uv "Вот. Готово. А теперь самое главное…"

    "С этим словами она водрузила своё творение на мамину голову."
    show le_romashki at center with dspr

    show uv gaset_laugh with dissolve

    uv "Ой, как здорово!"
    
    un "Правда?"
    show uv gaset_smile with dspr

    uv "Максик, правда здорово?"
    gg "Да… Тебе… э-э-э… очень идёт."

    hide le_romashki at center with dissolve

    show un smile3 pioneer at center with dissolve
    un "Спасибо."

    play sound sfx_dinner_horn_processed

    uv "О! Это, наверное, на обед зовут. Как раз успели.{w} Лена, покажешь дорогу до столовой?"

    show un smile pioneer with dspr

    un "С радостью!"
    window hide

    scene bg ext_path_day with dissolve
    $ renpy.pause(0.25)
    scene bg ext_square_day with dissolve

    window show
    "Лена повела нас в столовую, хотя в данном случае проводник был не особо нужен."

    scene bg ext_dining_hall_away_day with dissolve

    play music music_list["smooth_machine"] fadein 2

    un "Вот наша столовая."
    show uv gaset_smile at left with dissolve
    show un smile pioneer with dspr


    uv "М-м-м… как вкусно пахнет. Неужели котлеты?"
    un "Не знаю. Наверное."
    window hide

    scene bg int_dining_hall_day with dissolve

    show uv gaset_smile at left with dissolve
    show un smile pioneer with dspr

    play ambience ambience_dining_hall_full fadein 2

    show un smile2 pioneer with dspr

    window show
    un "Моё место вон там. Но мы же увидимся после обеда, да?"
    uv "Обязательно."

    hide un with dissolve

    jump TS_dining_hall_scene

label TS_clubs_meet_miku:
    scene ext_square_day
    show uv gaset_smile with dissolve
    window show
    gg "Давай к кружкам."
    show uv gaset_sur at left with dspr
    uv "Почему туда?"
    gg "Славя говорила, что там какие-то кибернетики."

    show uv gaset_angry with dspr

    uv "Ты - ссыкло! Тут уйма красивых девушек, а ты выбрал единственное место, где одни парни."
    gg "Спасибо, что хоть к гомосекам меня не причислила."

    scene bg ext_musclub_day with dissolve

    show uv gaset_normal at left with dissolve

    play music music_list["miku_song_flute"] fadein 2

    gg "Смотри вот тут была газета про юных гениев. {w} Готов поспорить, эти чудики - внутри."

    show uv gaset_sur at left with dspr

    uv "Почему ''чудики''?"
    gg "Все учёные - чудики."

    scene bg int_musclub_day with dissolve

    show uv gaset_normal at left with dspr

    uv "Это не сильно похоже на лабораторию."
    gg "Спасибо, кэп. Это больше на музыкальный магазин похоже."
    uv "Есть кто живой?"

    play sound sfx_knock_door3_dull

    mi "Я тут. Секундочку…"

    show mi smile pioneer at center with dissolve

    mi "Здрасте. Простите, я тут решила прибраться. {w}Нашла старую запись в нотном стане и задумалась. Прямо под роялем. А тут слышу голос, а это вы.{w} Кстати, я Мику. А вас как зовут? Вы верно новенькие. Пришли ко мне записаться?"

    show uv gaset_smile with dspr

    uv "Юля и Максим."
    gg "…И Максим."
    mi "Как здорово. Вы, наверное, брат и сестра.{w} Так похожи. Я всегда мечтала, чтобы у меня был братик или сестричка. Мы могли бы вместе играть или даже петь дуэтом.{w} А вы на чём играете? На скрипке? На трубе? На гитаре? У нас так много инструментов. А играть некому. Вот обидно, правда?{w} Хотя, если хочется играть, а не на чем - это ещё обидней."
    "Ну хоть кто-то считает, что мы похожи."
    "Хотя не исключено, что для этой девушки - все белые на одно лицо."

    show uv gaset_laugh2 with dspr

    uv "Максим играет на гитаре. Но только когда его никто не слышит. {w} Стесняется. Даже во двор гитару никогда не брал или на костёр."
    th "Откуда она про это знает?"

    show uv gaset_smile with dspr

    mi "Как здорово.{w} Что играет, а не что стесняется. Что стесняется - не очень здорово.{w} Я, если честно, тоже стеснялась когда начинала. А у нас после первого года в музыкальной школе выступление было. Я так волновалась, что забыла поклониться. Вышла и сразу пошла к пианино, чтобы сыграть.{w} Мне, правда, тогда всего восемь лет было."
    mi "А чём это я? Ах, да! Максим сыграй нам что-нибудь. {w} Вот. Держи акустику.{w} Я её только сегодня настраивала. Точнее перенастроила шестую струну. Я её вчера спустила в дробь д, чтобы одну песенку сыграть и забыла подтянуть."

    "Пока я пытался переварить этот поток сознания меня усадили на стул и вручили акустическую гитару."

    mi "Играй."

    show uv gaset_laugh with dspr

    uv "Спой, Максик, не стыдись."
    gg "Я, если честно, давно не играл."
    mi "Не важно. Главное, чтоб руки помнили. {w} Я тоже иногда переживаю, что всё забыла, а ака возьму инструмент в руки - так сразу всё вспоминаю. {w}Главное начать, а там песня сама…"

    play sound sfx_dinner_horn_processed

    play music music_list["timid_girl"] fadein 2
    show uv gaset_smile with dspr

    mi "Ой, не повезло. ну ничего страшного. В следующий раз сыграешь.{w} Пошлите на обед! Тут так здорово кормят. Гречка чуть ли не каждый день.{w} У нас в Японии - это дефицит. А рыба только раз в неделю. По четвергам. Я так и не поняла почему…"

    scene bg ext_path_day with dissolve
    $ renpy.pause(0.25)
    scene bg ext_square_day with dissolve
    $ renpy.pause(0.25)
    scene bg ext_dining_hall_away_day with dissolve

    "Мику не замолкала ни на секунду пока мы шли."

    "Юля едва ли успела вставить пару слов. Я вообще молчал."
    th "Хотя на языке вертелся вопрос: \"На кой ляд на стенах музыкального кружка висела стенгазета про науку?\""
    th "Неужто она запала на одно из тех блондинчиков, которые были в той вырезке?"
    th "Чёрт!"
    th "Может, Юля права, и я в самом деле везде вижу пошлый подтекст?"

    scene bg int_dining_hall_people_day
    show mi smile pioneer at center
    show uv gaset_smile at left
    with dissolve
    play ambience ambience_dining_hall_full fadein 2

    mi "Вот там моё место. Спасибо за компанию Максимка и Юлька. Ещё увидимся…"

    hide mi with dissolve

    jump TS_dining_hall_scene

label TS_dining_hall_scene:
    gg "А где наше место?"
    uv "Сходи поищи свободное. А я пока еды возьму."

    hide uv gaset_smile with dissolve

    "Сказать было проще, чем сделать."

    show us normal pioneer at center with dissolve

    play music music_list["i_want_to_play"] fadein 2

    gg "Здорова, малая! Не занято?"

    show us angry pioneer with dspr

    us "Это кто это малая?"
    gg "Ну не я же! Сколько в тебе роста?"

    show us grin pioneer with dspr

    us "Два с половиной метра!"
    gg "Ну тогда во мне три метра."
    us "А я… а я… а у меня вот что есть!"

    "Девочка, порывшись в кармане, достала коробок спичек."

    th "Она что, хочет спичками похвастаться?"
    "Не угадал."
    "В коробке был огромный майский жук."
    th "Так. Ну в анекдотах после такого соперничества, мальчики достают писюн со словами: \"А у меня вот что есть\"."
    th "Но в столовой такой трюк чреват последствиями."
    th "Да ещё и перед малолеткой."
    "Я прикинул все \"за\" и \"против\" и решил позорно капитулировать."

    show us normal pioneer with dspr

    gg "Ладно. Этот раунд ты победила."

    show us smile pioneer with dspr

    us "То-то же!"

    show uv gaset_laugh at right with dissolve

    uv "Всем привет. Я взяла тебе пять котлет."
    gg "Тут только три."

    show uv gaset_laugh2 with dspr

    uv "Путь от раздачи был не близкий. Пришлось ополовинить миску."

    show us laugh pioneer with dspr

    us "Ты рифмуешь, как поэт."
    uv "И отделяю мух от котлет."

    show us surp1 pioneer with dspr

    us "А причём тут мухи?"

    show uv gaset_laugh with dspr

    uv "А потому что мы - Мухины. Ха-ха-ха… Я - Юля. Это вот - Максим."
    gg "Можно просто Макс."

    show us smile pioneer with dspr

    us "А я Ульянка."

    show uv gaset_smile with dspr

    uv "Можно просто Янка?"

    show us normal pioneer with dspr

    us "Не… Янка - это Яна. {w} Совсем другое имя. Ульянка - это Улька. {w} Но мне так не нравится. {w} Похоже на пулька или срулька. Или грязнулька."

    gg "Грязнулька - это прям в тему. {w} У тебя все руки в краске."

    show uv gaset_sur2 with dspr

    uv "Так вот, кто табличку на площади переделал!"
    show us laugh2 pioneer with dspr

    us "Ага. Только это секрет. Вы никому не говорите."

    show uv gaset_laugh with dspr

    uv "Замётано. {w} Максику, кстати, очень понравилась твоя шутка. Он минут пять смеялся."

    show us smile pioneer
    show uv gaset_smile
    with dspr

    us "Правда?"
    gg "Вроде того. Но руки лучше помыть."

    show us surp2 pioneer with dspr

    "Я посмотрел на Юлю. Она лизала тыльную сторону своей ладони."

    show uv gaset_normal with dspr

    uv "Что? Я тоже решила умыться."
    gg "Языком?"

    show uv gaset_smile with dspr

    uv "Ах… да! {w} Совсем забыла.{w}  Мы просто с Максиком играли в карты. И я проиграла желание. И поэтому должна была до обеда изображать котика.{w}  Мяу. {w} Ха-ха-ха… Слава Богу уже не надо."

    show us normal pioneer with dspr

    "Мы приступили к еде. Ульянка справилась быстрее всех. И теперь подозрительно косилась на наши порции."
    "Юля же, наоборот, ела очень медленно. То и дело наклоняю голову, когда жевала."
    "Выглядело не сильно кринжово. Скорей, что она смакует. А не демонстрирует свои кошачьи атавизмы."

    play music music_list["always_ready"] fadein 2

    show us dontlike pioneer with dspr

    us "Ой! Панамка пришла. {w} Сейчас кому-то влетит…"
    gg "Панамка?"
    us "Наша вожатая."

    show mt angry pioneer at left with moveinleft

    mt "Советова! Опять безобразничаешь?"

    show us surp3 pioneer with dspr

    us "Что я сделала? Это не я. Я больше не буду!"
    mt "Я это уже слышала. И не собираюсь…"

    show mt surprise pioneer with dspr

    mt "Мухины? Вы почему тут сидите?"
    gg "Мы - это…"

    show uv gaset_sur with dspr

    uv "Больше мест не было. А что случилось?"

    show mt angry pioneer with dspr

    mt "Кто-то напроказничал."

    show us sad pioneer with dspr

    us "А что сразу я. Мало ли кто мог ту табличку испортить?"
    mt "Какую табличку? Ты о чём? {w} Я про Серёжины вещи, которые ты стащила, пока он мылся."

    show us surp2 pioneer
    show uv gaset_smile
    with dspr

    us "Вещи? Какие вещи? Ничего не знаю. У меня алиби."

    show mt angry pioneer with dspr

    mt "Ты мне зубы не заговаривай.{w} Тут только одна хулиганка, способная на это.{w} Будешь дежурить после обеда."

    show us sad pioneer with dspr

    us "Опять?"

    window hide
    menu:
        "Прикрыть Ульянку":
            jump TS_cover_ulyana
        "Промолчать":
            jump TS_keep_silent

    label TS_cover_ulyana:
        $ up += 1  # Очки Ульянки +1
        window show
        gg "Насчёт вещей. Это, как бы, я. Виноват. Вот."

        show mt surprise pioneer with dspr

        mt "Не поняла. Зачем? Как?"
        show uv gaset_laugh with dspr

        uv "Ой, да всё случайно вышло. Максик хотел с дороги помыться. {w}А я его вещи в сумочку положила. А он не знал, да по ошибке чужие взял.{w} Мы обязательно вернём… Серёже да?.. его вещи."

        show mt laugh pioneer with dspr

        mt "Ну молодцы, что сами во всём сознались. Только надо ещё извиниться перед Эле… перед Серёжей."

        show us grin pioneer with dspr

        us "И передо мной! И передо мной!"

        show mt angry pioneer with dspr

        mt "Цыц. Сперва про табличку расскажи."
        
        show us shy2 pioneer with dspr

        us "Что рассказывать? Я просто пошутила."
        mt "Вот и ответишь за свою шутку."

        show us sad pioneer with dspr

        us "Э-э-эх! А я хотела сходить на пляж…"

        jump TS_after_ulyana_choice

    label TS_keep_silent:
        window show
        "Кто бы мог подумать, что наша операция по добыче одежды вот так кому-то аукнется?"
        "Даже стыдно немного."
        "Надо линять, пока этот таинственный Серёжа не узнал свою рубашку с шортами."

        mt "За свои поступки надо отвечать."

        show us sad pioneer with dspr

        us "Только теперь я за чужие отвечаю. {w}Э-э-эх! А я хотела сходить на пляж…"

        jump TS_after_ulyana_choice

    label TS_after_ulyana_choice:
        hide us with dissolve

        show mt normal pioneer with dspr

        mt "Вы уж простите за этот спектакль. Надо было проследить, чтобы вас в другое место посадили"
        show uv gaset_laugh with dissolve
        uv "Ничего. Мы обязательно перевоспитаем Ульянку и сделаем её образцовой пионеркой."

        show mt laugh pioneer with dspr

        mt "Ну удачи с этим. А пока лучше переоденьтесь в надлежащую форму. Славя ещё не выдала?"
        show uv gaset_smile with dspr

        uv "Как раз собирались."
        mt "Отлично"

        show mt normal pioneer with dspr

        mt "Юля…{w} м-м-м…{w} у нас не принято в головных уборах в столовой находиться."

        show uv gaset_shame with dspr

        uv "Я это…{w} в общем…{w} не могу…"

        "Надо вмешаться."

        gg "У неё была операция на черепе. Врачи сказали полгода держать голову прикрытой."

        show mt surprise pioneer with dspr

        mt "Ох!{w} Ну тогда ладно. Но смени его на что-то более…{w} пионерское."
        show uv gaset_laugh with dspr

        uv "Есть!"

        show mt smile pioneer with dspr

        mt "Отлично!"

        hide mt with dissolve

        play music music_list["everyday_theme"] fadein 2

        show uv gaset_smile with dspr

        uv "Ну пошли переодеваться"
        gg "Угу."

        "И вернуть чужие вещи."
        "И помыться."
        window hide

        scene bg ext_dining_hall_away_day with dissolve
        stop ambience fadeout 1
        $ renpy.pause(0.25)
        scene bg ext_square_day with dissolve
        $ renpy.pause(0.25)
        scene ext_house_of_ggs_day with dissolve

        window show
        gg "Давай ты первая?"
        show uv gaset_sur with dissolve

        uv "Первая - что?"
        gg "Ну пойдёшь переодеваться."
        uv "А вместе мы почему не можем? Голой ты меня уже видел…"
        gg "Зато ты меня не видела."
        show uv gaset_laugh2 with dspr

        uv "Тем более! Будет справедливо, если и я посмотрю на тебя а-ля натюрель."
        gg "Ты сейчас серьёзно? {w}Тебе так нужен паритет в этом вопросе?"

        show uv gaset_laugh with dspr

        uv "Шучу-шучу. Мы вполне можем переодеться, не глядя друг на друга…{w} Скорей всего."
        hide uv

        show int_extra_house_dayy_form at truecenter with dissolve
        show uv gaset_laugh2 at left zorder 1 with dissolve

        uv "Здорово! Славя уже принесла форму."
        gg "И бельё."
        uv "Бельё нам не понадобиться. А вот форма…{w} Ух ты! Тут даже шапочка есть. Супер!"
        window hide

        hide uv
        
        $ renpy.pause(0.75)
        show int_extra_house_dayy at truecenter
        show uv pioneer_sur at left
        with dissolve

        window show
        uv "Ну? Как я тебе?"

        gg "Настоящая пионерка!"
        uv "Мне идёт?"
        gg "Да… кхе-кхе… Очень красиво смотрится."
        show uv pioneer_smile with dspr

        uv "Уже лучше. А теперь попробуй сформулировать это так, как будто ты - не пещерный человек."
        gg "Хм-м-м… \"Тебе идёт\"?"
        uv "А теперь так, как будто я - девушка, которая тебе нравится в романтическом плане."

        "Я задумался на несколько секунд."

        gg "Ты всегда выглядишь отлично, но теперь просто сногсшибательно!"

        show uv pioneer_laugh with dspr

        uv "Бинго!{w} С третьей попытки.{w} Но ничего. Я ещё сделаю из тебя нормально парня."
        gg "Значит нормальный, с твоей точки зрения, это тот который рассыпается в лестных комплиментах?"
        uv "Нормальный - это тот который понимает что такое условности и принятые нормы. {w}Например в обществе принято говорить дамам комплименты, в независимости от того, хочешь ты затащить её в постель, или нет."
        gg "Как-то самонадеянно с твоей стороны рассуждать о наших нормах.{w} Ты полчаса назад языком умывалась."

        show uv pioneer_smile with dspr

        uv "Эй…. мы тут, чтобы изменить твою жизнь, а не мою."
        gg "Как скажешь. И что делать теперь? Или снова решение - за мной?"
        uv "Именно."
        gg "Ульянка говорила, что тут пляж есть. Можно сходить туда.{w} А по дороге закинем штаны туда, где взяли."
        uv "Можно и на пляж. Только, сам понимаешь, мне в воду нельзя."
        gg "Ничего страшного. Объясним твоё аква-воздержание той самой черепно-мозговой травмой."

        show uv pioneer_laugh with dspr
        
        uv "Класс, Максик. С комплиментами у тебя идёт туго. {w}Зато врать ты учишься с пугающей скоростью."
        window hide

        play music music_list["sweet_darkness"] fadein 2

        scene ext_house_of_ggs_day with dissolve
        $ renpy.pause(0.25)        
        scene exxt_shower_day
        show uv pioneer_smile at left
        with dissolve

        window show
        gg "Я мигом."
        uv "Забей. Кинь прямо тут. Серёга быстрей найдёт."
        gg "Да. Логично."
        window hide

        scene bg ext_square_day with dissolve
        $ renpy.pause(0.25)
        scene bg ext_beach_day
        show uv pioneer_smile at left
        with dissolve

        window show
        uv "Смотри ка. Твоя мамка тут."
        gg "Где?"
        uv "Вон, в тенёчке. Книжку читает. Хе-хе… Теперь понятно, в кого ты такой затворник-книгочей."
        gg "И ничего я не затворник. Я часто выхожу из дома."
        show uv pioneer_laugh with dspr
        uv "А если исключить техникум и пьянки?"
        gg "Ну… эм-м-м…"

        "Я запнулся, пытаясь вспомнить свои активности, не связанные с алкоголем."
        "И не смог!"
        th "Неужели вся моя активная социальная жизнь - это всего навсего замаскированный алкоголизм?"
        gg "Вот. На речку пришёл."
        show uv pioneer_smile with dspr
        uv "Умница! А теперь подойди и пообщайся с девушкой."

        show un surprise swim at center with dissolve

        gg "Привет, ма-а-атличная погодка, да?"
        un "Что? Ах… да. Действительно. {w}Очень отличная.{w} В смысле, хорошая."

        "Юля пнула меня локтём."

        gg "Эм-м-м… {w}тебе очень идёт этот купальник."

        show un shy swim with dspr

        un "Правда? {w}А я так переживала, что он слишком…"
        gg "Откровенный?"
        un "Наоборот. Слишком закрытый. {w}Даже у Слави - круче. А у Панамки… {w} в смысле, у Ольги Дмитриевны - вообще, как у американских фотомоделей."

        th "Хотел бы я на это посмотреть."

        show un normal swim with dspr

        un "Юля, а где твой купальник."
        uv "А у меня нету. {w}Мне даже в воду лезть нельзя. Так…. {w}ножки помочить."

        show un sad swim with dspr

        un "Это грустно. Если хочешь, можешь составить мне компанию."
        uv "А что ты делаешь? {w}Читаешь?{w} А что?"

        show un shy swim with dspr

        un "Чехова. Чайка."
        uv "Хм-м-м…{w} звучит, как что-то скучное. Давай лучше замок лепить."
        un "Но я же…{w} не маленькая."
        uv "А мы большой замок слепим. {w}Такой, что там даже жить можно будет."

        show un surprise swim with dspr

        un "Ну не знаю…"

        show un shy swim with dspr

        un "А ты тоже будешь с нами строить?"

        "Прежде, чем я придумал вежливый отказ, вмешалась Юля."

        uv "Конечно, будет. Максимка обожает строить. {w}Он потому на строительный и собирается пойти."

        th "Точно!"
        th "Именно поэтому."
        th "Не потому что больше баллов никуда не хватило."
        th "Это, оказывается, моё призвание."

        gg "Да, конечно.{w} Почему бы и нет."

        show un smile swim with dspr

        un "С чего начнём?"
        uv "Командуй, Максик."
        gg "С фундамента."

        "Я напустил на себя важный вид."

        play music music_list["reminiscences"] fadein 2

        scene cg sand_castle with dissolve 

        "Не смотря на то, что Юля и Лена были очень разными, они сразу же нашли общий язык."
        "В чём, конечно же, заслуга Юли."
        "Мама плохо сходилась с новыми людьми."
        "А Юля, каким-то мистическим способом нашла ключик ко всем. К маме, к Славе, к вожатой... Да чего уж там. И ко мне тоже."
        "Она же была тем менеджером, который дёргал нашу бригаду на предмет дэдлайна."
        "И хотя мы работали все втроём, почему-то именно с Леной наши руки то и дело касались."
        "Не знаю, как её, а меня это сильно смущало."
        "Мне хватило утреннего инцедента."

        scene bg ext_beach_day
        show un smile swim at center
        show uv pioneer_normal at left
        with dissolve

        uv "Готово! Можно жить."
        un "Для нас он маловат. Но малыши, может, поместятся."
        gg "Максимум один малыш. И то, не слишком крупный."

        "Рядом с нами как ошивался десятилетний упитанный мальчик."
        "Он подозрительно косился на наше творение. Так что я на всякий случай погрозил ему кулаком."

        show un shy swim with dspr

        un "Я вся извазюкалась. Надо ополоснуться.{w} Пойдём купаться в речку."
        uv "Давайте лучше чем-нибудь другим займёмся.{w} Я видела сетку для волейбола."
        un "Э-э-э да. Мы… {w}ребята иногда играют. {w}Но у нас нет мячика…"
        uv "Не проблема. Сейчас быстренько отыщем.{w} Где эта длинная девушка с длинными косами,{w} как бишь ей?"
        un "Славя?"
        uv "Да. {w}Она тут специалист по \"достать/найти\".{w} Надо у неё спросить."
        un "Она, просто, помощница вожатой."
        uv "Да-да… Где её можно найти?"
        un "На главной площади, кажется…"
        uv "Я мигом!"

        hide uv with dissolve

        show un smile swim with dspr

        play music music_list["smooth_machine"] fadein 2

        un "Может всё таки искупаемся, пока ждём твою сестру."

        "Я замешкался с ответом."
        "Никак не могу привыкнуть, что Юлю считают моей сестрой."
        "Поэтому первой мыслью было, что мама обращается не ко мне."
        "Второй мыслью, что у меня есть тайная единоутробная сестра. И сейчас мы втроём обнаружим у себя одинаковые родинки и начнём танцевать."
        "Но Лена восприняла моё молчание в другом смысле."

        show un shy swim with dspr

        un "Можем и так подождать. {w}Если не хочешь купаться. {w}Думаю, она быстро вернётся. Юля такая…"
        gg "Быстроногая?"

        show un smile swim with dspr

        un "Я хотела сказать живчик. {w}Но не смогла найти женскую форму для этого слова…"
        gg "Егоза."
        un "Точно! {w}Наверное, с такой сестрой скучать не приходится."
        gg "Угу."
        th "Это ещё мягко сказано. Мы знакомы меньше суток, а я уже очутился в прошлом и беседую за своей полуобнаженной матерью."
        th "И удивляюсь только тому, что ничему не удивляюсь."
        th "Где-то в мозгу включился тумблер, что это - просто красочный сон."

        show un smile2 swim with dspr

        un "Чем-то похожа на нашу Ульянку. {w}Ты её знаешь?"
        gg "Да. Познакомились уже."
        un "Она тебя не успела разыграть?"
        gg "Нет."
        un "Повезло. {w}Мне она лягушку подсунула. {w}Сказала что даст что-то вкусное…"

        show un shy swim with dspr

        un "Я так испугалась. {w}Больше от неожиданности. Представляешь?"
        gg "Понимаю. Сам не люблю всяких слизких гадов."
        un "А ведь кто-то их ест."
        gg "Ну может после термообработки они уже не такие слизкие."
        un "Я бы всё равно не стала."
        gg "Я сам не ел, но слышал, что по вкусу на курицу похоже."

        show un shocked swim with dspr

        un "Гадость!"
        gg "Но считается деликатесом."

        show un smile swim with dspr

        gg "Вообще все эти национальные деликатесы берутся из тех времён, когда с едой было не важно. Вот и ели люди всяких лягушек, змей, крокодилов… {w}Или взять какую-нибудь пиццу. {w}Это ж только с голодухи можно придумать: раскатать тесто на тонкий кружок и насыпать туда всё что съедобного осталось. Кусочек колбаски, сыра, грибы…"

        show un shy swim with dspr

        un "А ты ел пиццу? {w}Круто! {w}Вкусная?"

        th "Чёрт! Я думал что в перестроечные времена уже все её попробовали.{w} Или это такая же экзотика, как Макдональдс?"

        gg "Ну да. Ничё так."
        un "На что похоже?"
        gg "Блин! Даже не знаю…{w} На пиццу.{w} Сложно описать. Вроде хот-дога. Только с колбасой и грибами."

        th "Ну вот."
        th "Очередной анахронизм."
        th "Вообще, не понятно на кой ляд я поднял эту кулинарную тему?"
        th "По идее, я должен мотивировать маму на успех. На заколачивание бабла. А не на вредную пищу."

        show un smile2 swim with dspr

        un "Прикольно."
        gg "Угу. {w}Я думаю, если открыть в нашем городе пиццерию - будет много клиентов."

        show sl normal sport at left
        show uv pioneer_smile at fleft
        with dspr

        play music music_list["always_ready"] fadein 2

        uv "А вот и мы. С мячиком."
        th "А мы только начали бизнес-план составлять."
        gg "Здорово. {w}Вчетвером будем играть?"

        show sl smile sport with dspr

        sl "Вшестером.{w} Ещё Саша и Серёжа."

        show kib el_norm at fright with dspr
        show kib sh_norm at right with dspr

        sh "Привет."
        el "Привет."

        "Это, случайно, не тот парень, чьи вещи мы стырили?"

        el "Кто с кем будет играть? {w}Чур я с Шуриком."
        sl "Давайте новички будут капитанами.{w} Юля, Макс - выбирайте игроков."
        gg "Я выбираю… Шурика! Раз уж он такой крутой."

        show kib sh_sur with dspr

        sh "Я вовсе не…"
        uv "Я выбираю Сергея."

        show kib el_sur with dspr

        el "Но я же… Так не честно!"
        sl "Всё честно. Макс? Кого выберешь?"
        window hide
        menu:
            "Выбрать Славю":
                $ lp_sl += 1
                jump TS_choose_sl
            "Выбрать Лену":
                $ lp_un += 1
                jump TS_choose_un

    label TS_choose_sl:
        window show
        gg "Славя."
        
        th "Конечно некрасиво вот так отказывать матери. Но Славя определённо выглядит более спортивной."
        
        show sl smile sport
        show un sad swim
        show kib el_norm
        show kib sh_norm
        with dissolve
        
        uv "Отлично.{w} А я выбираю Лену. {w}Как называется ваша команда, Максик?"
        gg "Обязательно придумывать название?"
        uv "Как без этого?"
        gg "Ладно…"
        
        "Из головы тут же вылетели все брутальные слова. И крутилась одна лишь пицца с хот догами."
        th "Пицца, пицца…"
        th "Папа Джонс? Додо? Доминос…"
        
        gg "\"Домино\"."
        uv "Какое глупое название. {w}А мы будем называться… \"импульсы\". Как вам?"
        
        sl "Бодренькое."
        el "Физическое. А мы импульсы силы или импульсы массы?"
        uv "Не умничай."
        sh "Скажи спасибо, что не доминошки."
        un "Только я переодеться сбегаю, не возражаете?"
        th "Возражаю... Переодевайся тут."
        "Но Лена моих мыслей не услышала и пошла в кабинку"
        hide un with dissolve
        "..."
        "..."
        show un normal sport with dissolve
        un "Я готова, начинаем?"
        
        scene cg volleyball with dissolve
        
        "Мы встали по разные стороны сетки. Право подавать первой уступили Славе."
        
        "Наша команда была заметно сильнее. У Импульсов тащил, в основном Сергей. Юля больше веселилась, чем играла. Лена… напротив принимала участие только если мяч летел прямо к ней."
        
        "Славя играла здорово. Несколько раз она могла забить гол самостоятельно, но предпочла уступить это право мне."
        window hide
        
        scene bg ext_beach_day with dissolve
        show sl smile sport at center
        show un smile sport at cright
        show uv pioneer_smile at cleft
        show kib el_norm at fright
        show kib sh_norm at fleft
        with dissolve

        window show
        "Мы победили с разгромным счётом 10:3. Потом поменялись сторонами и снова победили 10:7."
        
        play music music_list["get_to_know_me_better"] fadein 2
        
        un "Всё. Я устала. Давайте заканчивать."
        sl "Согласна. К тому же скоро ужин. Надо ещё успеть помыться."
        
        show el upset pioneer with dspr
        
        el "Я уже сегодня мылся."
        
        show sl serious sport with dspr
        
        sl "Что ты как маленький? Помоешься ещё раз."
        
        scene bg ext_path_day
        show sl normal sport at center
        with dissolve
        
        sl "Спасибо, что выбрал меня."
        gg "Эм-м-м…{w} спасибо, что так классно играла."
        
        show sl shy sport with dspr
        
        sl "Да ладно! Мы же так…{w} понарошку. Вполсилы."
        
        "Интересно, как бы она играла в полную силу?"
        
        jump TS_shower_scene

    label TS_choose_un:
        window show
        gg "Лена."
        
        th "Конечно, Славя выглядела поспортивней, но некрасиво вот так отказывать матери."
        
        show un smile swim
        show sl sad sport
        with dissolve
        
        uv "Отлично. А я выбираю Славю. Как называется ваша команда, Максик?"
        gg "Обязательно придумывать название?"
        uv "Как без этого?"
        gg "Ладно…"
        
        gg "\"Домино\"."
        uv "Какое глупое название. А мы будем называться… \"импульсы\". Как вам?"
        
        show un smile2 swim
        
        sl "Миленькое."
        el "Физическое. А мы импульсы силы или импульсы массы?"
        uv "Не умничай."
        sh "Скажи спасибо, что не доминошки."
        un "Только я переодеться сбегаю, не возражаете?"
        th "Возражаю... Переодевайся тут."
        "Но Лена моих мыслей не услышала и пошла в кабинку"
        hide un with dissolve
        "..."
        "..."
        show un normal sport with dissolve
        un "Я готова, начинаем?"
        
        scene cg volleyball_un with dissolve
        
        "Мы встали по разные стороны сетки. Право подавать первой уступили Славе."
        
        "Наша команда была заметно слабее. У Импульсов тащила, в основном Славя. Лена принимала участие только если мяч летел прямо к ней."
        
        scene bg ext_beach_day with dissolve
        show sl smile sport at center
        show un smile sport at cright
        show uv pioneer_smile at cleft
        show kib el_norm at fright
        show kib sh_norm at fleft
        with dissolve

        "Мы проиграли с разгромным счётом 10:3. Потом поменялись сторонами и проиграли 10:7."
        
        play music music_list["get_to_know_me_better"] fadein 2
        
        un "Всё. Я устала. Давайте заканчивать."
        sl "Согласна. К тому же скоро ужин. Надо ещё успеть помыться."
        
        show kib el_sur with dspr
        
        el "Я уже сегодня мылся."
        
        show sl serious sport with dspr
        
        sl "Что ты как маленький? Помоешься ещё раз."
        
        scene bg ext_path_day
        show un normal sport at center
        with dissolve
        
        un "Спасибо, что выбрал меня."
        gg "Эм-м-м… {w}спасибо, что так классно играла."
        
        show un shy sport with dspr
        
        un "Правда? Я конечно старалась, но получалось не очень."
        gg "Главное, что нам было весело."
        gg "Но ещё важнее, что динамика положительная. Счёт во второй партии сократили. Значит в третьей могла бы быть и ничья. А четвёртую бы обязательно выиграли."
        
        show un smile sport with dspr
        
        un "Точно!"
        window hide

    label TS_shower_scene:
        scene exxt_shower_day with dissolve

        show sl normal sport at center
        show un normal sport at cright
        show uv pioneer_smile at cleft
        show kib el_norm at fright
        show kib sh_norm at fleft
        with dissolve

        window show
        uv "Мальчики - налево, девочки - направо."
        sl "Вообще-то наоборот."
        uv "Не важно. Главное не перепутаться."
        
        hide sl
        hide un
        hide uv
        hide sh
        hide el
        with dissolve
        stop music fadeout 2
        scene int_shower_day with dissolve
        play sound sfx_close_water_sink
        
        th "Освежиться - это то, что сейчас надо."
        "Я случайно задел локтём дальнюю стенку."
        
        play sound sfx_punch_medium
        
        "И услышал точно такой же стук с той стороны."
        
        "Я постучал два раза."
        
        play sound sfx_pat_shoulder_hard
        
        th "Это с женской стороны кто-то прикалывается!"
        
        play music music_list["eternal_longing"] fadein 2
        
        th "Жаль я не знаю азбуку морзе."
        "С той стороны послышался более глухой стук. Как будто стучали не костяшками, а чем-то мягким."
        
        "На этот раз, я решил не повторять, а поскрёбся ногтями."
        "На поскрёбывания мне ответили смехом. Но я так и не смог идентифицировать, что за девушка там была."
        "На этом наше миленькое тайное общение закончилось."
        
        play music music_list["take_me_beautifully"] fadein 2

        scene exxt_shower_day with dissolve
        show uv pioneer_smile at center with dissolve
        
        "Я вышел из душа последним. Остальные уже успели ополоснуться и двигались в направлении столовой. Только Юля меня ждала."
        
        uv "Наконец-то. Я уж думала ты там заснул."
        gg "Только на пару мгновений."
        uv "Пошли скорей. Я умираю от голода."
        window hide

        scene bg ext_path_day with dissolve
        $ renpy.pause(0.75)
        scene bg ext_dining_hall_away_day with dissolve
        
        window show
        "Необычайная для меня активность после обеда взрастила зверский аппетит. Главным образом, волейбол."
        "Но и перестукивания в душе заставили попотеть."
        th "Это было очень невинно и в то же время интимно."
        th "Даже меня, парня избалованного интернет порнухой, проняло. И что чувствовала девушка с той стороны стенки - я могу только догадываться."
        th "Пикантности добавляла таинственность. Конечно, я надеялся что там была Славя."
        th "Но если и Лена… то…"
        th "Чёрт!"
        th "За полдня общения я уже перестал воспринимать её, как мать."
        th "И как основной объект моей миссии."
        th "По уму, мне с ней не в мячик играть и замки строить надо, а проводить профилактическую беседу."
        
        scene bg int_dining_hall_day
        show us normal pioneer at center
        show uv pioneer_smile at right
        with dissolve
        
        play music music_list["i_want_to_play"] fadein 2
        
        us "Явился. Не запылился. Ты чего такой довольный?"
        uv "Влюбился, потому что."
        
        show us grin pioneer with dspr
        
        us "Правда? И на кого он запал?{w} Дай ка угадаю… на Яну?"
        gg "Кто это?"
        us "Это самая красивая девочка из третьего отряда. После меня конечно.{w} На самом деле, и не особо-то красивая. Просто у неё самые большие сиськи."
        
        show uv pioneer_laugh at right with dissolve
        
        uv "Это - точно не она.{w} Максику всегда больше жопки нравились, а не сиськи."

        th "Тут она права. Достаточно изучить историю моего браузера."
        th "Впрочем, слабонервным лучше этого не делать."
        
        show us laugh pioneer with dspr
        
        us "Выходит и у меня тогда есть шанс, так?"
        gg "Будь я лет на пять младше"
        
        show us angry pioneer with dspr
        
        us "На пять? {w}Сколько, по-твоему, мне лет?"
        gg "Двенадцать?"
        us "Мне пятнадцать. {w}Будет. {w}Скоро."
        gg "Не важно. Главное, что меньше шестнадцати."
        
        show us calml pioneer with dspr
        
        us "А что такого важного в шестнадцать?"
        uv "Максик - озабоченный. Поэтому всё, что он говорит, надо смотреть через призму секса."
        
        show us laugh pioneer with dspr
        show uv pioneer_smile at right with dspr
        
        us "Фу таким быть!"
        gg "А не то что?"
        
        show us grin pioneer with dspr
        
        us "Скажу Панамке, что ты ко мне приставал."
        gg "М-м-м...{w} То есть, что избавить меня от излишней озабоченности, ты грозишься обвинить меня излишне озабоченным?"
        us "Именно так!"
        gg "Ладно. Ты снова победила."
        
        show us smile pioneer with dspr        
        
        us "А теперь повторяй за мной: \"Я не буду всё сводить к сексу\""
        gg "Я не буду всё сводить к сексу."
        us "\"Пока мне не разрешит Ульянка\""
        gg "Пока мне не разрешит Ульянка."
        us "\"А потом мы с ней потрахаемся\""
        show uv pioneer_laugh at right with dissolve

        gg "А потом… Да ну тебя"
        
        show us laugh pioneer with dspr

        if lp_sl > 0:
            $ chosen_girl = "Славю"
        else:
            $ chosen_girl = "Лену"

        uv "А я думаю, что Максик запал на [chosen_girl]. Не зря же он с ней за одну команду играл."
        
        us "Прикольно. А ты позовёшь [chosen_girl] на свидание?"
        gg "Если и позову, то не стану тебе сообщать.{w} Ещё не хватало, чтобы ты пришла и всё испортила."
        
        show us grin pioneer with dspr
        
        us "Ты зануда. Надеюсь она тебе откажет…"
        
        if lp_sl > 0:
            show sl smile pioneer at left with dissolve
            show un shy pioneer at fleft with dissolve
        else:
            show un smile pioneer at left with dissolve
            show sl shy pioneer at fleft with dissolve
        
        play music music_list["silhouette_in_sunset"] fadein 2
        show uv pioneer_sur at right with dissolve
        
        un "Макс…им, а мы тут подумали… {w}Не хочешь составить нам компанию? Мы…{w} это собрались на костёр."
        sl "Будет весело. {w}Мику возмёт гитару. Сыграет что-нибудь."
        
        gg "Да, конечно. Я с радостью присоединюсь."
        show uv pioneer_smile at right with dissolve
        
        show us smile pioneer with dspr
        
        us "И я! И я! Я тоже с вами пойду."
        
        show sl serious pioneer with dspr
        
        sl "Во-первых, не перебивай старших.{w} Во-вторых, тебе не приглашали."
        
        show us sad pioneer with dspr
        
        us "Но Славя я…"
        sl "Или ты хочешь поговорить об этом с Ольгой Дмитриевной?"
        us "Не хочу."
        
        show sl normal pioneer with dspr
        
        sl "Не грусти.{w} Зато сегодня можешь не ложиться до одиннадцати."
        
        show us normal pioneer with dspr
        
        us "Правда? А помадой поделишься?"
        
        show sl smile pioneer
        show un smile pioneer
        with dspr
        
        sl "Так уж и быть."
        
        show us smile pioneer with dspr
        
        uv "Ура!"
        un "Юль, а ты…"
        show uv pioneer_normal at right with dissolve
        uv "Я - минус. Лучше составлю компанию Ульянке.{w} Заодно прослежу, чтобы она матерные слова на зеркале не написала."
        
        show us grin pioneer with dspr
        
        us "Не знаю я никаких матерных слов."
        sl "Так мы тебе и поверили."
        us "Честно-честно. {w}А \"трахаться\" - это не матерное слово.{w} Ой!"
        
        show uv pioneer_smile at right with dissolve
        show us shy pioneer
        show sl angry pioneer
        show un shy pioneer
        with dspr
        
        us "А что я?{w} Я ничего!{w} Это всё Максимка. {w}Это он меня научил"
        gg "Чего?"
        sl "С Максимом мы поговорим.{w} А теперь марш отсюда!"
        
        hide us with dissolve
        
        gg "Честное слово, я ничего подобного…"
        
        show sl normal pioneer
        show un normal pioneer
        with dspr
        
        sl "Да знаю. Ульянка - та ещё врушка."
        un "И я не раз слышала, как она уже употребляла это слово.{w} Ну… которое на \"Т\""
        
        show un shy pioneer with dspr
        
        sl "Значит договорились. {w}Встречаемся у ворот через полчаса."
        gg "Замётано."
        
        hide sl
        hide un
        with dissolve
        
        show uv pioneer_smile at center with dissolve
        
        gg "Юля, какого чёрта?"
        uv "Что не так?"
        gg "Почему ты меня бросаешь?"

        show uv pioneer_laugh at center with dissolve

        uv "Что такое? Крутой парень из криминального района боится провести пару часов с юными девушками?"
        gg "Не в этом дело!"
        uv "А в чём?"
        gg "Ну-у-у…{w} как бы…{w} вдруг я сделаю что-то не так. Нарушу пространственно-временной континуум или вроде того…"
        uv "Вау! Ты смог произнести такую сложную фразу. И даже в ударении не ошибся."
        gg "Юль, я серьёзно. Там будет моя мама и…"

        show uv pioneer_smile at center with dissolve

        uv "Вот и отлично. {w}Ты должен поговорить с ней и убедить её…{w} что ты там хочешь? {w}Стать богатым. Или типа того."
        gg "Да, но как ты себе это представляешь?  В смысле, почему она будет меня слушать?"
        uv "Потому что запала на тебя."
        gg "Что? Не говори ерунды."
        uv "Это - не ерунда. Это - правда."
        gg "Да с чего ты взяла?"
        uv "Это же очевидно. {w} Легко читается по взгляду,{w} по речи,{w} по поведению…"
        gg "Я ничего подобного не заметил."

        show uv pioneer_angry at center with dissolve

        uv "Потому что ты - чурбан, а я - внимательная и наблюдательная."
        gg "Стоп!{w} Давай ка определимся. {w} Почему если я вижу от других разные сигналы, то я - озабоченный; а если ты, то ты - наблюдательная?"

        show uv pioneer_smile at center with dissolve

        uv "Ха-ха-ха… Вопрос хороший. {w} Навскидку, потому что ты видишь и интерпретируешь сигналы только связанные с сексом. {w}А я смотрю шире."
        uv "И когда я говорю \"запала\" это не значит, что она готова вот прям сейчас задрать юбку и стать раком. {w}Это значит, что ты ей приглянулся.{w} Вот и всё. {w}Новый парень. Необычный, интересный, симпатичный…"
        gg "В каком месте я симпатичный?"
        uv "И раз ты ей понравился, она будет воспринимать всё сказанное тобой на полном серьёзе. {w}Как сектант от своего гуру."
        gg "Хм-м-м… мы сбились с темы. {w} Почему ты не хочешь идти с нами? "
        uv "Включи голову, Максик! {w}Младшая сестричка будет мешать романтической обстановке. Думаешь почему спровадили Ульянку?"
        gg "А тебя…"
        uv "Меня - просто постеснялись. {w}Но с точки зрения девчонок, я - такая же малая и глупая, как Ульянка."
        gg "Снова твоя хвалённая наблюдательность?"
        uv "Лишь глаза кошачьи - видят мир иначе."
        
        play music music_list["dance_of_fireflies"] fadein 2
        
        window hide
        scene bg ext_dining_hall_away_sunset with dissolve
        $ renpy.pause(0.25)
        scene bg ext_path_sunset with dissolve
        $ renpy.pause(0.25)
        scene ext_house_of_ggs_sunset with dissolve
        $ renpy.pause(0.25)
        scene int_extra_house_sunsset with dissolve 
        

        show uv pioneer_smile at center with dissolve
        
        $ sunset_time()
        $ persistent.sprite_time = "sunset"
        window show
        gg "Будут ещё какие-нибудь наставления? {w}Или твой юный падаван готов?"

        show uv pioneer_laugh at center with dissolve

        uv "Только если \"падаван\" - от слова поддавать. {w}Выжрать пять литров пива ты, конечно, можешь. {w}А вот сразиться с ситхом врядли."
        gg "А если это три ситха, но очень красивых?"
        uv "Потянешь. {w}Главное не доставай световой меч из штанов раньше времени."
        gg "Обещаю"
        
        window hide
        scene ext_house_of_ggs_sunset with dissolve
        $ renpy.pause(0.25)
        scene bg ext_path_sunset with dissolve
        $ renpy.pause(0.25)
        scene bg ext_no_bus_sunset with dissolve
        

        show mi normal pioneer at left
        show sl normal pioneer at right
        with dissolve
        
        window show

        sl "Привет, Максим. Это - Мику."
        gg "Очень приятно."
            
        show mi smile pioneer with dspr
            
        mi "И мне. Так много слышала о тебе. Я гитару взяла. А ты играешь на гитаре? {w} Мальчики всегда выбирают гитару. Даже если их на скрипку или флейту записали. {w}Хотя был у нас в оркестре один мальчик, его на тромбон записали, а он всё норовил на барабанах постукать. {w}Правда, забавно?"
        gg "Угу"
        
        gg "А где Лена?"
        sl "Сказала, что задержится."
        
        show mi grin pioneer with dspr
        
        mi "И даже заранее извинилась.  {w}Вот ведь странно. Как можно извиняться за то, что ещё не сделал. Это ведь всё равно что заранее поздравить кого-то с днём рождения."
        mi "Вроде как и приятно, но всё равно преждевременно. И потом, когда оно будет, то окажется, что тебя уже поздравили, но ощущения уже не те. {w}Даже если повторно поздравить…"
        gg "Мне… надо отойти."
        
        scene bg ext_road_sunset with dissolve

        "Чтобы спасти свою психику от такой словесной DDOS-атаки, я немного отошёл."
        
        scene bg ext_no_bus_sunset with dissolve

        show mi normal pioneer far at left
        show sl normal pioneer far at right
        with dissolve
        "Когда я вернулся, монолог Мику уступил место диалогу."
        "Но я не спешил к ним присоединяться."
        th "Отсутствие Юли действовало мне на нервы. Оказалось, что я привязался к ней сильней, чем думал. Или она просто была тем звеном, которое связывало меня с реальностью."
        th "С моей реальностью."
        th "Пусть даже в ней она и была кошкой."
        th "С определённой точки зрения она изменилась даже меньше, чем мама."
        th "А самое главное, пока она была рядом, всегда была уверенность, что мы сможем в любой момент вернуться домой."
        th "Эдакий блок возврата от машины времени Стьюи Гриффина. Но живой и с хвостиком."
        "Теперь я чувствовал себя так, словно попал на вечеринку, где всего один знакомый и тот куда-то девался."
        "Славя и Мику всё ещё болтали о чём своём. А я, стоя в сторонке, делал вид что чрезвычайно увлечён статуями двух пионеров. Хотя, на самом деле, полностью равнодушен к такому виду искусства, как скульптура."
        "Ну фигура человека, ну и что?"
        "Ладно была девушка с веслом. Она хотя бы обнажённая. Есть на что посмотреть, что погладить."
        
        scene bg ext_no_bus_sunset with dissolve
        show mi normal pioneer at left
        show sl normal pioneer at right
        show un normal pioneer at center
        with dissolve
        
        "Наконец-то подошла Лена. Что-то в ней изменилось."
        
        sl "Лена, какая ты яркая!"
        mi "Прям, глаз не оторвать. Правда, Максимка?"
        gg "А?"
        
        show un shy pioneer with dspr
        
        un "Спасибо. Мне так приятно.{w} Мы в столовой говорили про помаду, и я вспомнила, что сестра подарила мне перед отъездом свою."
        sl "Как здорово!{w} Я всегда мечтала о сестре."
        mi "Братья это тоже хорошо. {w}Они могут защищать и помогать."
        
        show sl laugh pioneer with dspr
        
        sl "Это - да. {w}Но помадой-то они не пользуются."

        th "Не факт. Некоторые мальчики не только помадой пользуются, но и трусики женские примеряют."
        th "Впрочем, возможно люди в прошлом не такие испорченные как я?"
        th "Гендера у них всего два. Секс только после свадьбы. А при слове \"пенис\" - целомудренные дамы падают в обморок."
        

        sl "Пойдёмте на полянку, а то уже холодает."
        mi "Точно!{w} Ещё немного - и мои пальчики замёрзнут. И я не смогу играть."
        gg "А далеко эта полянка?"
        sl "Совсем рядом. {w}Это ж маленькая. {w}А большая подальше. Но нам сейчас большая ни к чему."

        window hide

        scene bg ext_polyana_sunset with dissolve
        pause(0.25)
        scene cg campfire with dissolve
        
        play music music_list["lightness"] fadein 2

        window show
        "На полянке было две самодельных скамейки. Мику тут же заняла одну и стала наигрывать мелодию."

        "Остальные занялись сбором дров. Совместными усилиями мы быстро набрали натаскали хвороста для маленького уютного огонька."
        "Славя села рядом с Мику, а мама расположилась напротив."
        
        scene bg ext_polyana_sunset
        show un normal pioneer at center
        with dissolve

        "Я сел рядом с ней, стараясь не касаться. Что было непросто, учитывая размер скамейки и тот факт, что мама случайно или намеренно была ближе к центру, чем к краю."
        "Сначала мы молча слушали игру и пение."
        
        un "Здорово."
        gg "Ты про музыку или про костёр."
        
        show un smile pioneer with dspr
        
        un "Про всё сразу.{w} По-моему, они прекрасно дополняют друг друга."
        gg "Пожалуй."
        un "Мне в лагерях всегда больше всего нравились именно вечера.{w} А тебе, что больше всего нравилось?"
        gg "Мне? Ну я какбы… не часто в лагерях бывал."

        th "Собственно, вообще ни разу."
        th "Ну в детских - так точно. Вот батю в колонии-поселении навещал, это да. Что мне там понравилось?"
        th "Да ничего. Мерзкое место."
        th "Разве, что пейзажи вокруг прикольные."

        gg "Природа, наверное."
        un "Да. Мне тоже. Ты, наверное, в крутых лагерях был, да?{w} У моря?"
        
        show un shy pioneer with dspr
        
        un "А может даже в самом… Артеке?"

        "Последнее слово Лена произнесла шёпотом."
        th "Видать в её филологической вселенной слово \"Артек\" было таким же сакральным, как и слово \"трахаться\"."
        th "Может они даже как-то связанные."
        th "В лагерях трахаться нельзя, но в Артеке можно. И даже нужно."
        th "А то иностранцы засмеют."

        gg "Нет, что ты.{w} Никаких морей. Только речки или озёра. {w}Я и моря-то, если честно, ни разу не видел."
        un "Правда? {w}Я тоже. {w}Интересно, я когда-нибудь там побываю?"
        gg "Конечно!"

        th "Я даже мог назвать точные даты."
        th "Через три года скатается на балтийское море. Через 7 лет в Одессу, на их с батей свадебное путешествие. Через 15 лет - снова на Чёрное море. На сей раз в Ялту."

        un "Спасибо.{w} Я тоже верю в это."
        gg "Просто веришь? {w}Или есть какие-то планы?"
        
        show un surprise pioneer with dspr
        
        un "А какие тут могут быть планы? Я просто… {w}ну поступлю в институт и буду понемногу откладывать на поездку со стипендии."
        gg "Ну вот это и есть план."
        
        show un laugh pioneer with dspr
        
        un "Да. Действительно. {w}Я и не подумала. {w}Просто по другому на это смотрела…"
        gg "Это называется \"плыть по течению\"."
        un "Разве это так плохо?"
        gg "Зависит от того, куда это течение ведёт. Вдруг к водопаду?"
        
        show un sad pioneer with dspr
        
        un "Я об этом не думала. {w}Просто если, всё продумывать и просчитывать, то… {w}как-то слишком грустно жить."
        gg "Не всё. Только некоторые вещи."
        un "Деньги?"
        gg "Деньги, работу, карьеру…{w} Если всё пустить на самотёк, то… {w}могут случится неприятные последствия."
        un "Какие например?"
        gg "Бедность."

        show un surprise pioneer with dspr

        un "Бедность?"

        th "Чёрт!"
        th "Как ей объяснить, что страны, к которой она привыкла, скоро не будет. И всем придётся крутится самим. Не рассчитывая на помощь государства."
        th "Причём, объяснить без \"спойлеров\" о будущем."

        gg "Я имею в виду относительную бедность. {w}Не когда, есть нечего, а когда ну… есть что, но очень мало. {w}Понимаешь?"
        
        show un smile2 pioneer with dspr
        
        un "Нет."
        window hide

        $ night_time()
        $ persistent.sprite_time = "night"

        scene bg ext_polyana_night with dissolve
        play music music_list["into_the_unknown"] fadein 2

        window show
        gg "Ну хорошо. {w}Вот смотри, ты же собралась поступать в … {w}какой-то институт, так?"
        show un normal pioneer with dissolve
        un "Думаю, что в пед.{w} Мне нравится возиться с детишками. {w}Но пока не уверена. {w}Папа очень сильно хочет, чтобы я пошла по его стопам - и стала врачом."

        th "Зашибись!"
        th "Две самые нищенские профессии в будущем. Учителя и врачи."
        th "И что будет со мной, если я уговорю её не поступать в пед? Исчезну? Растворюсь в воздухе? Или лопну, как мыльный пузырь?"
        th "Юля, где же ты? Когда так нужна…"
        "Я попытался представить Юлю."
        show black
        show uv pioneer_laugh
        show prologue_dream
        with dissolve
        with vpunch
        "Воображаемая кошка-девушка стукнула меня лапой-рукой по лбу."
        th "Что ж…"
        th "Невербальный совет вполне понятен."

        hide black
        hide uv
        hide prologue_dream
        with dissolve

        gg "Интересный выбор.{w} А какой твой самый любимый предмет в школе?"

        th "Я знал ответ на этот вопрос."
        th "Но мне надо было подвести её к нужному решению саму."
        th "Как героям нолановского \"Начала\"."

        show un normal pioneer with dspr
        
        un "Математика."
        gg "Вот. {w}А как ты думаешь, сможешь заниматься математикой в меде?"
        un "Нет конечно. Там в основном биология. {w}Ну и химия ещё."
        gg "А в педе?"
        un "Ну-у-у…{w} если учить детей математике.{w} Правда у малышей в основном арифметика."

        gg "Ага. А с подростками работать - такое себе удовольствие."

        show un sad pioneer with dspr

        un "Ну да."
        gg "А где, как ты думаешь, можно серьёзно заниматься математикой?"
        un "На мехмате.{w} Но не думаю, что смогу туда поступить."
        gg "А если что-нибудь попроще? {w}Какой-нибудь радиофизический или экономический."
        
        show un normal pioneer with dspr
        
        un "Туда, может, и смогу, но…"
        gg "Вот и отлично!"
        un "Но как же дети?"
        gg "Всегда можно будет понянчить своих."
        
        show un laugh pioneer with dspr
        
        un "Ну они-то ещё не скоро будут."
        gg "А пока появятся можно и местными обойтись."
        
        show un surprise pioneer with dspr
        
        un "Местными?"
        gg "Ну пионерами. {w}Летом устроиться вожатой."
        un "А возьмут?"
        gg "Почему нет? Туда всех берут."
        
        show un shy pioneer with dspr
        
        un "Ну-у-у я не знаю. {w}Я же даже не помощница, как Славя."
        
        show mi normal pioneer at left
        show sl normal pioneer at right
        with dissolve
        
        "Я посмотрел на Славю. И только сейчас заметил, что и она и Мику притихли и слушали нас."
        gg "Простите, мы не хотели вам мешать."
        sl "Всё в порядке."
        mi "Всё равно я хотела сделать перерыв. {w}Может, ты пока сыграешь."
        
        play music music_list["reminiscences"] fadein 2
        
        "Девушка протянула мне гитару."
        
        show un smile pioneer
        show sl smile pioneer
        show mi smile pioneer
        with dspr

        "Но гитару взяла Славя и сыграла незнакомую мне песню."
        "Играла она не так классно, как Мику, но и не так паршиво, как сыграл бы я. Добротный такой уровень. В переходах играть можно и денежку накидают. (Мне бы накостыляли)."
        "Потом под твёрдым взглядом Мику и Лена взяла гитару в руки."
        "Сразу видно, у неё не забалуешь. Как человек - мягкий и возвышенный, а как учитель - настоящий цербер."
        "Но Лена превосходно сыграла, и мы поаплодироавли."

        "Потом инструмент вернулся к Мику."
        "А Славя достала термос с чаем…"

        "Мы посидели так час или два. Играли, пели, болтали обо всём на свете."
        th "Я потерял счёт времени."
        th "Да что там время… я даже забыл, что оказался в прошлом. И что симпатичная девушка по-соседству - это моя помолодевшая мать."
        th "Как будто очутился в своей компании. При этом трезвый."
        th "Так необычно."
        "Лена, вслед за ней и Мику начали зевать. Так что мы стали потихоньку собираться."
        window hide
        scene bg ext_path2_night with dissolve
        $ renpy.pause(0.25)
        scene bg ext_no_bus_night with dissolve
        $ renpy.pause(0.25)
        scene bg ext_square_night with dissolve
        $ renpy.pause(0.25)

        scene ext_house_of_ggs_night with dissolve
        
        show sl smile pioneer at left
        show un smile pioneer at center
        show mi smile pioneer at right
        with dissolve

        window show       
        gg "Спасибо за приятную компанию. {w}Было здорово."
        sl "Надо как-нибудь повторить."
        mi "Обязательно повторим."
        un "Спокойной ночи, Максим."
        gg "И вам."
        
        hide sl
        hide un
        hide mi
        with dissolve
        
        scene int_haus_night_off with dissolve
        
        play music music_list["mystery_girl_v2"] fadein 2
        
        gg "Юля? Ты тут?"
        uv "Конечно. Я всегда рядом."
        gg "А почему я тебя не вижу?"
        uv "Обернись"
        
        show uv pioneer_laugh at center with dissolve
        
        "Я повернулся и Юля повисла у меня на шее. От неожиданности я упал."
        
        play sound sfx_fall_wood_floor
        
        gg "Чёрт!"
        uv "Надо быть аккуратней."
        gg "Надо предупреждать заранее!"
        uv "Хорошо. Предупреждаю: сейчас ты снова упадёшь."
        stop music fadeout 2
        gg "Как я могу упасть, если я уже…"
        
        scene black with dissolve
        
        "Я почувствовал что, в самом деле, куда-то проваливаюсь. Последнее, что я слышал - это Юлин смех."
        "..."
        jump TS_gorod_day_2
